<template>
    <div class="guide-template" v-if="subtitles.length">
        <div class="guide-content">
            <page-title
            :title="page.title"
            :icon="page.icon"
            />

            <subtitle :title="subtitles[0].title" :mark="subtitles[0].mark" />
            <paragraph :ctx="
                `Окно редактирования является конструктором, которое предоставляет автору теста инструменты для составления вопросов и интерактивных заданий. Окно редактирования состоит из:`
            " />
            <guide-image :src="'15.png'" />
            <numeric-list :list="[
                `Панель содержания теста, где указаны все существующие вопросы теста и с помощью которой можно осуществлять переход между вопросами для их редактирвоания`,
                `Кнопка для возвращения в главную панель тестов`,
                `Кнопка открывающая окно загрузки word файла с тестовыми вопросами в текущий тест`,
                `Кнопка открывающая окно подписания теста`,
                `Переключатель автосохранения (по умолчанию автосохранение включено)`,
                `Кнопка добавления простого текстового вопроса в текущий тест`,
                `Кнопка раскрывающая список интерактивных заданий (включая вопроса с изображениями) для добавления их в текущий тест`,
                `Кнопка открывающая окно сохранения как экземпляра текущего состояния теста`,
                `Кнопка для ручного сохранения текущего прогресса в тестах (внесённых изменений)`,
                `Область редактирования шаблона тестового вопроса или задания`
            ]" />

            <subtitle :title="subtitles[1].title" :mark="subtitles[1].mark" />
            <paragraph :ctx="
                `На данный момент существует 3 типа тестовых вопросов-заданий:`
            " />
            <simple-list :list="[
                `простой текстовый вопрос`,
                `вопрос с изображениями`,
                `задание выбора области на картинке`
            ]" />
            <prompt :type="'info'" :ctx="
                `Нет никаких ограничений по количеству вопросов в тесте`
            " />

            <subtitle :title="subtitles[2].title" :mark="subtitles[2].mark" />
            <paragraph :ctx="
                `Простой текстовый вопрос, как понятно из названия, состоит из вопроса и нескольких ответов представленных в текстовом формате. Добавить его в текущий тест можно через нижнюю панель интсрументов окна редактирования.`
            " />
            <guide-image :src="'16.png'" />
            <paragraph :ctx="
                `После в панель содержания тестов добавиться новый вопрос и шаблон вопроса сразу же отобразиться в области редактирования. Элементы шаблона простого текстового вопроса:`
            " />
            <guide-image :src="'17.png'" />
            <numeric-list :list="[
                `Уникальный идентификатор вопроса (это не порядковый номер)`,
                `Метка даты и времени последнего внесённого изменения в текущий вопрос`,
                `Кнопка удаления текущего вопроса (после нажатие нужно будет нажать на кнопку подтверждения)`,
                `Поле контекста вопроса`,
                `Список тем текущего теста (темы, выбранные при создании теста). Из этого списка необходимо выбрать тему текущего вопроса`
            ]" />
            <guide-image :src="'20.png'" />
            <numeric-list :start="6" :list="[
                `Список уровней сложности (существуют лёгкий, средний и сложный уровни). Из этого списка необходимо выбрать сложность текущего вопроса`,
            ]" />
            <guide-image :src="'21.png'" />
            <numeric-list :start="7" :list="[
                `Переключатель многоответного вопроса. По умолчанию в вопросе есть лишь один верный ответ и в шаблоне он расположен первым. С помощью переключателя добавляется возможность устанавливать несколько правильных ответов (верные ответы выделены зелёными рамками)`,
            ]" />
            <guide-image :src="'18.png'" />
            <prompt :type="'warn'" :ctx="
                `Вместо использования ответов типа <u><b>Все ответы верны</b></u> рекоммендуется использовать возможность этого переключателя и указывать правильные ответы как верные, а вместо <u><b>Все ответы верны</b></u> указывать также верный либо неверный ответ.<br>При попадании экзаменуемому вопроса с несколькими правильными ответами ему будет необходимо отметить все верные ответы <u>иначе вопрос не засчитается как решённый</u>`
            " :media="['27.png', '28.png']" />
            <numeric-list :start="8" :list="[
                `Кнопка для добавления дополнительных вариантов ответов. Добавленные ответы можно удалить`,
            ]" />
            <guide-image :src="'19.png'" />
            <numeric-list :start="9" :list="[
                `Поле верного ответа`,
                `10,11,12 - поля с неверными ответами`,
            ]" />

            <subtitle :title="subtitles[3].title" :mark="subtitles[3].mark" />
            <paragraph :ctx="
                `Вопрос с картинками очень схож с простым текстовым вопросом за исключением, что в него можно добавлять изображения. Поддерживаемые форматы: JPEG, PNG, WebP`
            " />
            <prompt :type="'info'" :ctx="
                `Рекоммендуется использовать изображения в формате WebP, который обеспечивает отличное сжатие изображений при сохранении качества`
            " />
            <paragraph :ctx="
                `Добавление подобного вопроса осуществляется через список интерактивных вопросов, расположенного в нижней панели инструментов`
            " />
            <guide-image :src="'22.png'" />
            <paragraph :ctx="
                `Изображения можно загрузить через специальное поле загрузки файлов. Изображения могут быть прикреплены как к вопросу, так и к каждому ответу`
            " />
            <guide-image :src="'23.png'" />
            <prompt :type="'info'" :ctx="
                `Если вопрос не описан в поле контекста вопроса, но при этом к вопросу приклеплено изображение то вопрос считается валидным (т.е., если есть изображение то текст в вопросе не обязателен). Аналагичное правило применимо и к ответам.`
            " :media="['24.png', '25.png']" />

            <subtitle :title="subtitles[4].title" :mark="subtitles[4].mark" />
            <paragraph :ctx="
                `При добавлении в тест задания выбора области на картинке автор (составитель) теста должен составить вопрос, который призовёт экзаменуемого к действию, а именно к поиску и указанию курсором чего-либо на картинке. Говоря проще, автор теста составляет вопрос по типу поиска чего-либо (явления, предмета и т.п.) на прикреплённом к заданию изображении.`
            " />
            <guide-image :src="'26.png'" />
            <paragraph :ctx="
                `Шаблон задания не сильно отличается от предыдуших вопросов и дополнительно сосотоит из:`
            " />
            <guide-image :src="'29.png'" />
            <numeric-list :list="[
                `Поле загрузки изображения`,
                `Переключатель режима нескольких верных областей выделения на картинке`,
                `Область отображения загруженной картинки`
            ]" />
            <paragraph :ctx="
                `Для начала нужно загрузить изображение и составить под него вопрос:`
            " />
            <guide-image :src="'30.png'" />
            <paragraph :ctx="
                `Затем простым кликом мышки в области выделения нужно отметить искомую область, которая будет считаться правильным ответом. Границы области выделения обведены синим цветом. Теперь экзаменуемый при попадании ему этого задания должен будет отметить то место, где было отмечено составителем задания чтобы ответ засчитался. На месте клика появиться красный полупрозрачный квадрат. Его можно переставлять кликнув на другую область картинки`
            " />
            <guide-image :src="'31.png'" />
            <paragraph :ctx="
                `Под картинкой есть ползунок, который регулирует радиус погрешности ответа (радиус красного квадрата). Чтобы ответ экзаменуемого засчитался как верный, он должен отметить область входящую в красный квадрат, который поставил автор тестов`
            " />
            <guide-image :src="'32.png'" />
            <paragraph :ctx="
                `Если предмет не вмещается в один красный квадрат, то можно использовать режим нескольких верных областей и отметить предмет несколькими квадратами. Очистить все квадраты с картинки можно через кнопку <span style='color:#555'><b>Очистить</b></span>`
            " />
            <guide-image :src="'33.png'" />
            <prompt :type="'info'" :ctx="
                `Рекоммендуется использовать изображения качества Full HD (разрешением 1920x1080 пиксилей) или изображения в соотноошении разрешения 16:9 (ширина:высота) для того, чтобы изображение ровно влезало в область выделения (синюю рамку)`
            " />

            <subtitle :title="subtitles[5].title" :mark="subtitles[5].mark" />
            <paragraph :ctx="
                `Удаление любого вопроса в окне редактирован теста происходит с помощью кнопки удаления, расположенной в правом верхнем углу шаблона вопроса. Порядок удаления:`
            " />
            <numeric-list :list="[
                `Нажмите на кноку удаления`,
            ]" />
            <guide-image :src="'34.png'" />
            <numeric-list :start="2" :list="[
                `Нажмите на кнопку подтверждения удаления`,
            ]" />
            <guide-image :src="'35.png'" />

            <subtitle :title="subtitles[6].title" :mark="subtitles[6].mark" />
            <paragraph :ctx="
                `Панель содержания тестов главном образом необходима для переключения между вопросами-заданиями (переход на вопрос для его редактирования), а так же просмотра их содержания`
            " />
            <guide-image :src="'36.png'" />
            <paragraph :ctx="
                `Для осуществления перехода на другой вопрос достаточно кликнуть на него в панели содержания теста`
            " />
            <guide-image :src="'37.png'" />
            <paragraph :ctx="
                `Для просмотра содержания вопроса нужно лишь нажать на кнопку, находящуюся в правом верхнем углу панели содержания теста, которая раскроет полную панель и на которой будет возможно просмотреть контекст каждого вопроса и ответов к нему (от сюда тоже возможен переход по вопросам). Чтобы скрыть полную панель нужно нажать на это кнопку ещё раз`
            " />
            <guide-image :src="'38.png'" />
            <guide-image :src="'39.png'" />
        </div>

        <div class="guide-subtitles mb-6">
            <div style="position: fixed; width: 250px">
                <div class="mb-6">
                    <p class="mb-2 mt-2" style="font-size: 1em; color: #777;">Содержание</p>
                    <v-divider class="mt-2"></v-divider>
                </div>

                <div class="d-flex align-center mb-1" style="gap:5px">
                    <v-icon size="16" color="#777">{{ page.icon }}</v-icon>
                    <span style="font-size: 0.8em; text-transform: uppercase; font-weight: 600; color: #777">{{ page.title }}</span>
                </div>

                <div>
                    <div
                    class="subtitle-map-item"
                    v-for="subtitle in subtitles"
                    :key="subtitle.mark"
                    @click="goToSubtitle(subtitle.mark)"
                    >
                        <v-icon style="margin-top: 5px" size="8" color="var(--main-color)">mdi-circle</v-icon>
                        <span style="color: #666; font-size: 0.8em;">{{ subtitle.title }}</span>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>


<script>
import PageTitle from '../ui/PageTitle.vue';
import Subtitle from '../ui/Subtitle.vue';
import Paragraph from '../ui/Paragraph.vue';
import Prompt from '../ui/Prompt.vue';
import GuideImage from '../ui/GuideImage.vue';
import NumericList from '../ui/NumericList.vue';
import SimpleList from '../ui/SimpleList.vue';

export default {
    props: {
        page: Object,
        goToSubtitle: Function
    },
    data(){
        return {
            subtitles: []
        }
    },
    mounted(){
        this.prepareSubtitles()
    },
    methods:{
        prepareSubtitles(){
            this.subtitles = [
                { title: 'Знакомство с окном редактирования', mark: 'p2-st-1' },
                { title: 'Разновидности вопросов-заданий', mark: 'p2-st-2' },
                { title: 'Простой текстовый вопрос', mark: 'p2-st-3' },
                { title: 'Вопрос с изображениями', mark: 'p2-st-4' },
                { title: 'Задание выбора области на картинке', mark: 'p2-st-5' },
                { title: 'Удаление вопроса', mark: 'p2-st-6' },
                { title: 'Панель содержания теста', mark: 'p2-st-7' },
            ]
        }
    },
    components: {
        PageTitle,
        Subtitle,
        Paragraph,
        Prompt,
        GuideImage,
        NumericList,
        SimpleList
    },
}
</script>
